{
  "navbar_logo_alt": "FŐOLDAL",
  "navbar_title_home": "FŐOLDAL",
  "navbar_title_features": "FUNKCIÓK",
  "navbar_title_faq": "GYIK",
  "navbar_title_contact": "KAPCSOLAT",
  "slider_title": "A Magyar Túra App",
  "slider_message": "HuKi egy ingyenes túra térkép túrázóknak és természetjáróknak, amely integrálódik a magyarországi túraútvonalakkal. A projekt legfőbb célja, hogy segítséget nyújtson kirándulásaink során és hogy népszerűsítse a gyönyörű magyar tájaink felfedezését. A HuKi ingyenes, reklámmentes és nyílt forráskódú szoftver.",
  "google_play_badge": "https://play.google.com/intl/en_us/badges/static/images/badges/hu_badge_web_generic.png",
  "google_play_badge_alt": "Töltsd le a Google Play-ről",
  "features_hiking_trails_title": "Túraútvonalak",
  "features_hiking_trails_desc": "Az alkalmazás a klasszikus Magyar Túra réteget használja fel az országos túraútvonalakkal, amely integrálódik az alap térképpel.",
  "features_hiking_trails_alt": "Túraútvonalak",
  "features_layers_title": "Rétegek",
  "features_layers_desc": "Az alkalmazás számos alap térkép réteggel rendelkezik, úgy mint Mapnik, OpenTopo, TuHu, Google Műhold, Merretekerjek.hu.",
  "features_layers_alt": "Rétegek",
  "features_route_planner_title": "Útvonaltervező",
  "features_route_planner_desc": "Az útvonaltervezővel lehetőségünk van túraútvonalakon tervezni. Az alkalmazás megbecsüli a túra hosszát, idejét és egy GPX fájlt készít belőle.",
  "features_route_planner_alt": "Útvonaltervező",
  "features_gpx_title": "GPX nyomvonalak",
  "features_gpx_desc": "HuKi-val importálhatóak a GPX fájlok és megjeleníthetőek a térképen. Az app táv, idő becslést és emelkedési színezést készít.",
  "features_gpx_alt": "GPX nyomvonalak",
  "features_landscapes_title": "Tájegységek",
  "features_landscapes_desc": "HuKi térképes nézeten mutatja a tájegységeket, a hozzájuk tartozó kedvelt kirándulóhelyeket és túragyűjteményeket.",
  "features_landscapes_alt": "Tájegységek",
  "features_okt_title": "OKT - Országos Kéktúra",
  "features_okt_desc": "A kéktúrázók számára elérhető egy funkció, ahol az OKT, RPDDK, AKT kéktúra szakaszok és bélyegzőhelyek is megtekinthetőek.",
  "features_okt_alt": "OKT - Országos Kéktúra",
  "faq_title": "GYIK",
  "faq_subtitle": "Gyakran Ismételt Kérdések",
  "faq_ios_title": "Lesz iOS verzió is, mikor lesz elérhető iPhone-okra?",
  "faq_ios_desc": "Jelenleg nincs iOS verziója az alkalmazásnak, de már elkezdtem az előkészületeket. Ha tippelnem kéne, 2026 végére lehet egy használható verzió belőle, csökkentett funkcionalitással.",
  "faq_offline_title": "Van benne offline mód?",
  "faq_offline_desc": "Gyorsítótáras offline mód van benne. Minden betöltött térkép részlet bekerül egy 14 napos adatbázisba, ami offline is használható. Eddigi tapasztalataim szerint ez a módszer az esetek nagy részét lefedi: parkolóban vagy túra közben szinte mindig van annyi internet, hogy a szükséges részeket letöltse, ezért a pillanatnyi megszakadásokat észre sem vesszük.",
  "faq_full_offline_title": "Lesz benne full-offline mód, előre letölthető térképpel?",
  "faq_full_offline_desc": "Ezt már nagyon sokan kértétek tőlem, ezért mindenképp célkeresztben van. A jelenlegi raszteres render motorral ez nagyon nem lenne hatékony, több GB adatot kellene egyszerre letölteni teljes Magyarország térképhez. Több irányban is gondolkozok megoldásokban, pl. kisebb terület alapú letöltés vagy vektoros render motor használata.",
  "contact_title": "Kapcsolat",
  "contact_message": "Az alkalmazást hobbiból fejlesztem szabadidőmben és különösen örülök a személyes visszajelzéseknek, a célom hogy másnak is hasznos legyen az app!",
  "contact_email": "huki.app@gmail.com",
  "contact_github": "GitHub Repository",
  "footer_developer_title": "Fejlesztő",
  "footer_developer_name": "Mostoha Roland",
  "footer_developer_email": "roland.mostoha@gmail.com",
  "footer_developer_linkedin": "LinkedIn - Mostoha Roland",
  "footer_copyright": "Copyright © 2025. Minden jog fenntartva"
}